app/controllers/users_controller.rb

  def create
    @user = User.create(params[:user])
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 11 Sep 2011 22:02:55 UTC +00:00], ["email", "sthomas1618@gmail.com"], ["name", "Stephen Thomas"], ["updated_at", Sun, 11 Sep 2011 22:02:55 UTC +00:00], ["username", "sthomas"]]